; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	infrared2 - mode
	thermograph1 - mode
	spectrograph0 - mode
	GroundStation3 - direction
	Star4 - direction
	GroundStation7 - direction
	GroundStation9 - direction
	GroundStation14 - direction
	Star0 - direction
	GroundStation10 - direction
	GroundStation12 - direction
	Star2 - direction
	GroundStation13 - direction
	GroundStation1 - direction
	GroundStation8 - direction
	GroundStation11 - direction
	Star5 - direction
	GroundStation6 - direction
	Planet15 - direction
	Star16 - direction
	Star17 - direction
	Planet18 - direction
	Star19 - direction
	Planet20 - direction
	Planet21 - direction
	Phenomenon22 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 infrared2)
	(calibration_target instrument0 GroundStation12)
	(calibration_target instrument0 GroundStation8)
	(calibration_target instrument0 GroundStation10)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet20)
	(supports instrument1 thermograph1)
	(supports instrument1 infrared2)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 Star2)
	(supports instrument2 thermograph1)
	(supports instrument2 infrared2)
	(calibration_target instrument2 GroundStation11)
	(calibration_target instrument2 GroundStation8)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 GroundStation13)
	(supports instrument3 spectrograph0)
	(supports instrument3 infrared2)
	(calibration_target instrument3 GroundStation6)
	(calibration_target instrument3 Star5)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet21)
)
(:goal (and
	(have_image Planet15 thermograph1)
	(have_image Star16 spectrograph0)
	(have_image Star17 infrared2)
	(have_image Planet18 spectrograph0)
	(have_image Star19 thermograph1)
	(have_image Planet20 thermograph1)
	(have_image Planet21 thermograph1)
	(have_image Phenomenon22 infrared2)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 8
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 8
3. (turn_to satellite0 phenomenon22 planet20)
   deleted: (pointing satellite0 planet20)
   added: (pointing satellite0 phenomenon22)
   goals met: 0 of 8
4. (turn_to satellite0 star5 phenomenon22)
   deleted: (pointing satellite0 phenomenon22)
   added: (pointing satellite0 star5)
   goals met: 0 of 8
5. (calibrate satellite0 instrument0 star5)
   added: (calibrated instrument0)
   goals met: 0 of 8
6. (turn_to satellite0 phenomenon22 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon22)
   goals met: 0 of 8
7. (take_image satellite0 phenomenon22 instrument0 infrared2)
   added: (have_image phenomenon22 infrared2)
   goals met: 1 of 8
8. (turn_to satellite0 planet18 phenomenon22)
   deleted: (pointing satellite0 phenomenon22)
   added: (pointing satellite0 planet18)
   goals met: 1 of 8
9. (take_image satellite0 planet18 instrument0 spectrograph0)
   added: (have_image planet18 spectrograph0)
   goals met: 2 of 8
10. (turn_to satellite0 star16 planet18)
   deleted: (pointing satellite0 planet18)
   added: (pointing satellite0 star16)
   goals met: 2 of 8
11. (take_image satellite0 star16 instrument0 spectrograph0)
   added: (have_image star16 spectrograph0)
   goals met: 3 of 8
12. (turn_to satellite0 star17 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 star17)
   goals met: 3 of 8
13. (take_image satellite0 star17 instrument0 infrared2)
   added: (have_image star17 infrared2)
   goals met: 4 of 8
14. (turn_to satellite1 star2 planet21)
   deleted: (pointing satellite1 planet21)
   added: (pointing satellite1 star2)
   goals met: 4 of 8
15. (calibrate satellite1 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 4 of 8
16. (turn_to satellite1 planet15 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 planet15)
   goals met: 4 of 8
17. (take_image satellite1 planet15 instrument1 thermograph1)
   added: (have_image planet15 thermograph1)
   goals met: 5 of 8
18. (turn_to satellite1 planet20 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 planet20)
   goals met: 5 of 8
19. (take_image satellite1 planet20 instrument1 thermograph1)
   added: (have_image planet20 thermograph1)
   goals met: 6 of 8
20. (turn_to satellite1 planet21 planet20)
   deleted: (pointing satellite1 planet20)
   added: (pointing satellite1 planet21)
   goals met: 6 of 8
21. (take_image satellite1 planet21 instrument1 thermograph1)
   added: (have_image planet21 thermograph1)
   goals met: 7 of 8
22. (turn_to satellite1 star19 planet21)
   deleted: (pointing satellite1 planet21)
   added: (pointing satellite1 star19)
   goals met: 7 of 8
23. (take_image satellite1 star19 instrument1 thermograph1)
   added: (have_image star19 thermograph1)
   goals met: 8 of 8
